scripts/running_sample/small_structure/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/170
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

D 0;
F 220; //170 good
X 1e7;//1e10;
W 1e10;
// -x means multiplying
// 1000 tooo much, to low
// 500 still too much
// 250?

porousBlockage_x1
{
    type            DarcyForchheimer;

    cellZone        porousBlockage_x1;



    d   ($D $X $X);
    f   ($F $X $X);

    coordinateSystem
    {
        type    cartesian;
        origin (0 0 0);
        //origin  (1.22 1.14 0);
        coordinateRotation
        {
            type    axesRotation;
            //e1  (1 0 0);
            //e2  (0 1 0);
            e2      (0 1 0);
            e3      (-1 0 2);
        }
    }
}

porousBlockage_x2 //porosity2
{
    type            DarcyForchheimer;

    cellZone        porousBlockage_x2;



    d   ($D $X $X);
    f   ($F $X $X);

    coordinateSystem
    {
        type    cartesian;
        origin (0 0 0);
        //origin  (-0.92 1.14 0);
        coordinateRotation
        {
            type    axesRotation;
            //e1  (1 0 0);
            //e2  (0 1 0);
            e2      (0 1 0);
            e3      (1 0 2);
        }
    }
}

porousBlockage_y1 //porosity11
{
    type            DarcyForchheimer;

    cellZone        porousBlockage_y1;

    d   ($D $X $X);
    f   ($F $X $X);
    //d   ($X $D $X);
    //f   ($X $F $X);

    coordinateSystem
    {
        type    cartesian;
        origin  (0 0 0);
        coordinateRotation
        {
            type    axesRotation;
            //e1  (1 0 0);
            //e2  (0 1 0);
            e2      (1 0 0);
            e3      (0 1 2);
        }
    }
}

porousBlockage_y2 //porosity22
{
    type            DarcyForchheimer;

    cellZone        porousBlockage_y2;

    d   ($D $X $X);
    f   ($F $X $X);
    //d   ($X $D $X);
    //f   ($X $F $X);

    coordinateSystem
    {
        type    cartesian;
        origin  (0 0 0);
        coordinateRotation
        {
            type    axesRotation;
            //e1  (1 0 0);
            //e2  (0 1 0);
            e2      (1 0 0);
            e3      (0 -1 2);
        }
    }
}

porousBlockage_roof //porosity3
{
    type            DarcyForchheimer;

    cellZone        porousBlockage_roof;


    d   ($D $X $X);
    f   ($F $X $X);
    //d   ($X $X $D);
    //f   ($X $X $F);
    coordinateSystem
    {
        type    cartesian;
        origin  (0 0 0);
        coordinateRotation
        {
            type    axesRotation;
            //e1  (1 0 0);
            //e2  (0 1 0);
            e2      (1 0 0);
            e3      (0 1 0);
        }
    }
}


// ************************************************************************* //
