scripts/running_sample/small_structure/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    box
    {
        type slip;
    }
    
    small_test
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    // //Was same as small_test
    // porous_sides_x1
    // {
    //     type            kqRWallFunction;
    //     value           uniform 1;
    // }
    // porous_sides_x2
    // {
    //     type            kqRWallFunction;
    //     value           uniform 1;
    // }
    // porous_sides_y1
    // {
    //     type            kqRWallFunction;
    //     value           uniform 1;
    // }
    // porous_sides_y2
    // {
    //     type            kqRWallFunction;
    //     value           uniform 1;
    // }
    // porous_roof
    // {
    //     type            kqRWallFunction;
    //     value           uniform 1;
    // }




    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
}


// ************************************************************************* //
