scripts/running_sample/small_structure/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    box
    {
        type slip;
    }

    
    small_test
    {
        type            nutkWallFunction;
        value           uniform 0;
    }


    // //Was same as small_test
    // porous_sides_x1
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }
    // porous_sides_x2
    // {
    //     type            nutWallFunction;
    //     value           uniform 0;
    // }
    // porous_sides_y1
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }
    // porous_sides_y2
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }
    // porous_roof
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }


    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
